
#define PRIORITY_WEIGHT_PERPENDICULARITY 0.1f // вес добавки к приоритезации ребер - хотим чтобы чаще объединения шли перпендикулярно направлению градиента (в радианах)
#define PRIORITY_WEIGHT_MAGNITUDE (0.1f * (2*PI/255.0f)) // вес добавки к приоритезиации ребер - хотим чтобы чаще объединялись если похожи силы градиентов (в радианах/пиксели)

#define KD (2.0f*PI) // насколько можно расширять диапазон направлений, затухает от роста числа пикселей в кластере (в радианах)
#define KM 1500.0f // насколько можно расширять диапазон силы градиента, затухает от роста числа пикселей в кластере (в пикселях)

#define MIN_ALLOWED_DIRECTION_RANGE (PI/18.0f) // 10 градусов диапазон направлений градиентов в кластере - это всегда позволительно хорошо
#define MIN_ALLOWED_MAGNITUDE_RANGE (200.0f) // 200 пикселей диапазон сил градиентов в кластере - это всегда позволительно хорошо

#define CLUSTER_NPOINTS_THRESHOLD 20 // сколько пикселей должно попасть в кластер чтобы мы считали его хорошим

#define QUADS_CORNERS_DISTANCE_THRESHOLD 10 // сколько пикселей может быть между концом и началом двух последовательных кластеров для объединения в четверку
#define QUADS_CORNERS_DISTANCE_THRESHOLD2 (QUADS_CORNERS_DISTANCE_THRESHOLD*QUADS_CORNERS_DISTANCE_THRESHOLD)
